function convergenceBoxDiscreteRate(){
	var dataBJ=[
		  {
		    "value": [
		      "2018/04/28",
		      "0.00",
		      "5625",
		      "#1方阵#6汇流箱"
		    ],
		    "symbolOffset": [
		      19.19477739145296,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "0.00",
		      "5627",
		      "#1方阵#8汇流箱"
		    ],
		    "symbolOffset": [
		      36.090445942463546,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "357.91",
		      "5634",
		      "#1方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      29.417252557211754,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "284.47",
		      "5643",
		      "#2方阵#5汇流箱"
		    ],
		    "symbolOffset": [
		      -16.468050208094695,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "406.40",
		      "5650",
		      "#2方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      2.7737985945210255,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "308.77",
		      "5652",
		      "#7方阵#1汇流箱"
		    ],
		    "symbolOffset": [
		      1.602129934563834,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "295.25",
		      "5659",
		      "#7方阵#8汇流箱"
		    ],
		    "symbolOffset": [
		      -43.75731960004254,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "306.07",
		      "5661",
		      "#7方阵#10汇流箱"
		    ],
		    "symbolOffset": [
		      -34.36305163739787,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "270.53",
		      "5666",
		      "#7方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      -44.87392418214057,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "316.32",
		      "5668",
		      "#8方阵#2汇流箱"
		    ],
		    "symbolOffset": [
		      -25.90331249019431,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "280.92",
		      "5675",
		      "#8方阵#9汇流箱"
		    ],
		    "symbolOffset": [
		      -21.461857350236247,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "324.42",
		      "5677",
		      "#8方阵#11汇流箱"
		    ],
		    "symbolOffset": [
		      -18.09085591724061,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "468.04",
		      "5684",
		      "#9方阵#2汇流箱"
		    ],
		    "symbolOffset": [
		      0.18822837622381172,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "255.49",
		      "5686",
		      "#9方阵#4汇流箱"
		    ],
		    "symbolOffset": [
		      -32.75330023472172,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "279.72",
		      "5691",
		      "#9方阵#9汇流箱"
		    ],
		    "symbolOffset": [
		      34.001527852959086,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "311.90",
		      "5693",
		      "#9方阵#11汇流箱"
		    ],
		    "symbolOffset": [
		      19.718070625849066,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "241.90",
		      "5700",
		      "#10方阵#2汇流箱"
		    ],
		    "symbolOffset": [
		      47.991210721037476,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "326.00",
		      "5702",
		      "#10方阵#5汇流箱"
		    ],
		    "symbolOffset": [
		      17.627242865675598,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "428.00",
		      "5709",
		      "#10方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      -27.454123615086313,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "400",
		      "5711",
		      "#10方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -11.517328430314691,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "0.00",
		      "5716",
		      "#11方阵#2汇流箱"
		    ],
		    "symbolOffset": [
		      -2.818004246012066,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "0.00",
		      "5718",
		      "#11方阵#4汇流箱"
		    ],
		    "symbolOffset": [
		      19.196008887196342,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "360",
		      "5725",
		      "#11方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      42.86716480270307,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "0.00",
		      "5727",
		      "#11方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -19.854021385581866,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "345.92",
		      "5734",
		      "#12方阵#3汇流箱"
		    ],
		    "symbolOffset": [
		      5.43314379183721,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "369.04",
		      "5736",
		      "#12方阵#6汇流箱"
		    ],
		    "symbolOffset": [
		      -13.496278844664786,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "223.81",
		      "5741",
		      "#12方阵#11汇流箱"
		    ],
		    "symbolOffset": [
		      46.06117266573875,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "355.40",
		      "5743",
		      "#12方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -7.662875342766476,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "400",
		      "5750",
		      "#12方阵#5汇流箱"
		    ],
		    "symbolOffset": [
		      -32.03919787056728,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "256.62",
		      "5752",
		      "#13方阵#3汇流箱"
		    ],
		    "symbolOffset": [
		      -29.054592045529425,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "262.08",
		      "5759",
		      "#13方阵#10汇流箱"
		    ],
		    "symbolOffset": [
		      -45.01887038020831,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "369.25",
		      "5761",
		      "#13方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      -45.277997368607885,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "357.57",
		      "5766",
		      "#14方阵#3汇流箱"
		    ],
		    "symbolOffset": [
		      -7.542327669992197,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "243.07",
		      "5768",
		      "#14方阵#5汇流箱"
		    ],
		    "symbolOffset": [
		      -40.378794142261874,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "353.19",
		      "5775",
		      "#14方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      24.131710575205645,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "336.21",
		      "5777",
		      "#14方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      36.898869720104244,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "237.21",
		      "5784",
		      "#15方阵#3汇流箱"
		    ],
		    "symbolOffset": [
		      29.306142611923647,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "257.83",
		      "5786",
		      "#15方阵#5汇流箱"
		    ],
		    "symbolOffset": [
		      -10.508256279125973,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "354.57",
		      "5791",
		      "#15方阵#10汇流箱"
		    ],
		    "symbolOffset": [
		      -48.15076390255195,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/28",
		      "385.47",
		      "5793",
		      "#15方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      45.88273876501165,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "390",
		      "5629",
		      "#1方阵#10汇流箱"
		    ],
		    "symbolOffset": [
		      12.663468165038068,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "0.00",
		      "5630",
		      "#1方阵#11汇流箱"
		    ],
		    "symbolOffset": [
		      -40.58656486334304,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "517.35",
		      "5631",
		      "#1方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      15.350149542162598,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "527.07",
		      "5632",
		      "#1方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -32.911294061908116,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "337.41",
		      "5645",
		      "#2方阵#7汇流箱"
		    ],
		    "symbolOffset": [
		      38.421765647502966,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "375.79",
		      "5646",
		      "#2方阵#8汇流箱"
		    ],
		    "symbolOffset": [
		      -9.753505070577937,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "364.94",
		      "5647",
		      "#2方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      45.06413189794665,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "413.55",
		      "5648",
		      "#2方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -26.50464882948921,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "371.71",
		      "5662",
		      "#7方阵#11汇流箱"
		    ],
		    "symbolOffset": [
		      41.41331190579301,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "337.98",
		      "5663",
		      "#7方阵#12汇流箱"
		    ],
		    "symbolOffset": [
		      32.98337080662314,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "357.77",
		      "5664",
		      "#7方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -19.558116919438373,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "336.61",
		      "5665",
		      "#7方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -32.71644779213749,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "377.94",
		      "5679",
		      "#8方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -39.05466414589224,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "372.37",
		      "5680",
		      "#8方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -11.818508537490423,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "428.88",
		      "5681",
		      "#8方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      48.88934617518851,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "338.37",
		      "5682",
		      "#8方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      -39.64764110276179,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "394.32",
		      "5695",
		      "#9方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -9.743818438187802,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "404.16",
		      "5696",
		      "#9方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -17.118467980015083,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "400.67",
		      "5697",
		      "#9方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      26.138800680906755,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "412.70",
		      "5698",
		      "#9方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      -36.98383597882125,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "0.00",
		      "5712",
		      "#10方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      38.85223334947405,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "340",
		      "5713",
		      "#10方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      28.624908595788085,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "0.00",
		      "5715",
		      "#10方阵#4汇流箱"
		    ],
		    "symbolOffset": [
		      -15.58217764915387,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "370",
		      "5729",
		      "#11方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      -6.015091568061258,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "355",
		      "5730",
		      "#11方阵#17汇流箱"
		    ],
		    "symbolOffset": [
		      27.070820760765685,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "0.00",
		      "5732",
		      "#11方阵#6汇流箱"
		    ],
		    "symbolOffset": [
		      38.16991758987585,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "317.65",
		      "5745",
		      "#12方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      -41.290493207748,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "212.00",
		      "5746",
		      "#12方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      -3.6014330626654285,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "312.55",
		      "5747",
		      "#12方阵#17汇流箱"
		    ],
		    "symbolOffset": [
		      -23.56020495437734,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "351.74",
		      "5748",
		      "#12方阵#18汇流箱"
		    ],
		    "symbolOffset": [
		      -8.467186845241216,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "273.91",
		      "5762",
		      "#13方阵#13汇流箱"
		    ],
		    "symbolOffset": [
		      -4.3497266554206035,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "488.70",
		      "5763",
		      "#13方阵#14汇流箱"
		    ],
		    "symbolOffset": [
		      -36.79028580772508,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "507.64",
		      "5764",
		      "#13方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      -30.11505950824026,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "565.61",
		      "5779",
		      "#14方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      31.008468118303085,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "446.96",
		      "5780",
		      "#14方阵#17汇流箱"
		    ],
		    "symbolOffset": [
		      -18.205359162514778,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "496.67",
		      "5781",
		      "#14方阵#1汇流箱"
		    ],
		    "symbolOffset": [
		      42.69299244921011,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "547.97",
		      "5782",
		      "#14方阵#2汇流箱"
		    ],
		    "symbolOffset": [
		      22.534564115109063,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "471.64",
		      "5796",
		      "#15方阵#15汇流箱"
		    ],
		    "symbolOffset": [
		      -17.68331751777665,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "444.69",
		      "5797",
		      "#15方阵#16汇流箱"
		    ],
		    "symbolOffset": [
		      -14.846792524173367,
		      0
		    ]
		  },
		  {
		    "value": [
		      "2018/04/29",
		      "341.08",
		      "5798",
		      "#15方阵#17汇流箱"
		    ],
		    "symbolOffset": [
		      -28.251777979865288,
		      0
		    ]
		  }
		];

	var listDt=[
	  "2018/04/28",
	  "2018/04/29"
	];
	var minVal=0;
	var maxVal=800;

	var optionp = {
        backgroundColor: 'rgba(0,0,0,0)',
        animation: false,
        grid: {
        	show:false,
        	top:30,
          left: 0,
          bottom: 1,
          right: 0,
          containLabel: true
        },
        dataZoom: [{
        	show:false,
            type: 'slider',
            startValue: listDt[0],
            endValue: listDt[1]
        }],
        visualMap: {
            show: false,
            min: minVal,
            max: maxVal,
            left: 'right',
            top: '1%',
            dimension: 1,
            inRange: {
                color: ['#d94e5d', '#eac736', 'green']
            },
            textStyle: {
                color: 'white'
            }
        },
        tooltip: {
            position: 'top',
            formatter: function (params) {
                var value = params.value;

                return '日期：' + value[0] + '<br />'
                     + '发电量：' + value[1] + '<br />'
                    + ' 汇流箱名称：' + value[3];
            }
        },
        plotOptions: {
            column: {
                pointWidth:1//设置柱状图宽度
            }
        },
        xAxis: {
            type: 'category',
            data: listDt,
            name: '日期',
            nameTextStyle: {
               color: 'white',
               fontSize: 11
            },

            splitLine: {
                show: false
            },
						axisLabel: {
	            textStyle: {
	              color: '#fff',
								fontSize: 11
	            }
						},
            axisLine: {
               lineStyle: {
                   color: 'white'
               }
            }
        },
        yAxis: [{
            type: 'value',
            name: '----日发电量(kWh)',
            min: 0,
            nameTextStyle: {
               color: 'white',
               fontSize: 11
            },
            axisLine: {
               lineStyle: {
                   color: 'rgba(255,255,255,1)'
               }
            },
						axisLabel: {
	            textStyle: {
	              color: '#fff',
								fontSize: 11
	            }
						},
            splitLine: {
               show: false
            }
        }


        ],
        series: [
            {
                name: '日发电量',
                type: 'scatter',
                data: dataBJ
            }

        ]
    };


var myChartp = echarts.init(document.getElementById('right2_con'));

myChartp.setOption(optionp);

window.addEventListener("resize",function(){
	myChartp.resize();
 });


}
