function kwhAbility(){

  var irr_MWKWh_data=[
    [
      "4.59",
      "3.24",
      "河北沧州污水厂建投2MW项目"
    ],
    [
      "4.70",
      "3.66",
      "河南漯河亚洁能3.5MW项目"
    ],
    [
      "7.06",
      "5.61",
      "石家庄灵寿30MW"
    ],
    [
      "4.40",
      "3.41",
      "胶南海尔"
    ],
    [
      "4.58",
      "4.00",
      "通裕重工4MW"
    ],
    [
      "4.98",
      "3.89",
      "山东菏泽樱花乐叶4MW项目"
    ],
    [
      "4.78",
      "3.55",
      "河北沧州欧亚管业乐叶6MW项目"
    ],
    [
      "5.05",
      "3.65",
      "河北石家庄亚洁能5.5MW项目"
    ],
    [
      "4.55",
      "3.70",
      "山东菏泽金正大乐叶6MW项目"
    ],
    [
      "4.50",
      "3.57",
      "山东菏泽郓城乐叶10MW项目"
    ],
    [
      "4.67",
      "4.10",
      "通裕重工二期8MW"
    ],
    [
      "5.48",
      "2.98",
      "山西太原国昶20MW项目"
    ],
    [
      "4.96",
      "4.13",
      "大庆长元10MW"
    ],
    [
      "4.92",
      "4.25",
      "辽宁台安10MW"
    ],
    [
      "4.66",
      "3.67",
      "河南内黄建投12MW项目"
    ],
    [
      "4.21",
      "3.42",
      "福建清流15MW"
    ],
    [
      "5.20",
      "4.24",
      "河北定州中科中电12MW项目"
    ],
    [
      "5.27",
      "4.21",
      "菏泽成武一期20MW"
    ],
    [
      "4.76",
      "3.43",
      "怒江兰坪一期20MW"
    ],
    [
      "4.24",
      "3.61",
      "四平伊通一期20MW"
    ],
    [
      "5.04",
      "4.06",
      "辽宁岫岩22MW"
    ],
    [
      "4.61",
      "3.67",
      "城盛科技二期20MW"
    ],
    [
      "5.23",
      "3.64",
      "海南海口白沙县隆基20MW项目"
    ],
    [
      "5.07",
      "3.90",
      "城盛发展二期20MW"
    ],
    [
      "4.84",
      "3.94",
      "湖北仙桃一期20MW"
    ],
    [
      "4.84",
      "4.19",
      "辽宁阜蒙20MW"
    ],
    [
      "5.03",
      "3.62",
      "城盛科技一期20MW"
    ],
    [
      "4.90",
      "4.02",
      "聊城莘县一期20MW"
    ],
    [
      "5.51",
      "4.13",
      "滨州北海农业一期20MW"
    ],
    [
      "5.50",
      "4.19",
      "德州武城县一期20MW"
    ],
    [
      "4.49",
      "3.84",
      "辽源东丰20MW"
    ],
    [
      "5.27",
      "4.24",
      "泰安肥城20MW"
    ],
    [
      "5.18",
      "4.25",
      "四川德昌一期20MW"
    ],
    [
      "5.04",
      "4.33",
      "合肥庐江20MW"
    ],
    [
      "6.08",
      "4.45",
      "河北保定涞源首奥20MW项目"
    ],
    [
      "5.33",
      "4.36",
      "山西河津国昶20MW项目"
    ],
    [
      "5.25",
      "4.55",
      "天津西青一期20MW"
    ],
    [
      "5.37",
      "4.63",
      "渭南澄城一期20MW"
    ],
    [
      "5.42",
      "4.45",
      "寿光一期20MW"
    ],
    [
      "5.96",
      "5.02",
      "陕西麟游一期20MW"
    ],
    [
      "6.09",
      "4.94",
      "河北邢台创世辉腾20MW项目"
    ],
    [
      "6.40",
      "5.36",
      "山西阳泉一期20MW"
    ],
    [
      "6.11",
      "5.25",
      "乌兰察布鑫盛一期20MW"
    ],
    [
      "6.32",
      "5.41",
      "内蒙古鑫盛20MW"
    ],
    [
      "5.19",
      "4.19",
      "山东巨野二期30MW大棚项目"
    ],
    [
      "5.18",
      "4.14",
      "贵州安龙电建30MW项目"
    ],
    [
      "5.18",
      "4.22",
      "河南延津一期30MW"
    ],
    [
      "5.56",
      "4.32",
      "山东巨野一期30MW大棚项目"
    ],
    [
      "5.71",
      "4.41",
      "贵州贞丰30MW"
    ],
    [
      "5.55",
      "4.67",
      "山东日照新东港30MW项目"
    ],
    [
      "4.45",
      "3.99",
      "河南马村36MW"
    ],
    [
      "6.36",
      "5.10",
      "河北阳原30MW"
    ],
    [
      "4.83",
      "4.00",
      "安徽蒙城40MW"
    ],
    [
      "6.07",
      "5.35",
      "乌海海南区30MW"
    ],
    [
      "4.68",
      "4.08",
      "亳州谯城40MW"
    ],
    [
      "6.11",
      "5.46",
      "巴彦淖尔鑫盛30MW"
    ],
    [
      "3.96",
      "3.36",
      "福建邵武50MW"
    ],
    [
      "5.14",
      "4.21",
      "河南滑县40MW"
    ],
    [
      "3.95",
      "3.18",
      "福建政和70MW"
    ],
    [
      "5.36",
      "4.34",
      "吉林大安50MW"
    ],
    [
      "5.24",
      "4.27",
      "石家庄藁城50MW"
    ],
    [
      "5.00",
      "4.25",
      "城盛发展一期60MW"
    ],
    [
      "5.37",
      "4.68",
      "德州武城代官耀盛100MW"
    ],
    [
      "5.26",
      "5.25",
      "河北蔚县首奥70MW项目"
    ],
    [
      "5.38",
      "4.36",
      "黑龙江大庆隆基80MW项目"
    ]
  ]

  var option = {
      tooltip : {
        trigger: 'item',
        formatter : function (params) {
            return '<p style="line-height:10px;font-size:12px;">'+params.data[2]+'</p><p style="line-height:10px;font-size:12px;">辐照量：'+params.data[0]+'Wh/㎡</p><p style="line-height:10px;font-size:12px;">MW发电量：'+params.data[1]+'WKh</p>';
        }
    },
      color:['#CCFF00'],
      grid: {
        x: 35,
        y:20,
        x2: 25,
        y2:38,
        borderWidth: 1

      },
      xAxis : [
          {
              name:'',//辐照kWh/㎡
              nameLocation:'middle',
              type : 'value',
              scale : true,
              axisLine: {
                  lineStyle: {
                      color: 'white'
                  }
              },
              splitLine: {
                  lineStyle: {
                      color: 'rgba(1,102,255,0.3)'
                  }
              },
              axisLabel: {
                  interval: 0,
                  textStyle: {
                      fontSize: 10,
                      color: 'white',
                      fontWeight:600
                      
                  }
              },
              axisLabel : {
                formatter: '{value}'
              }
          }
      ],
      yAxis : [
          {
              name:'',//MW发电量MWh
              type : 'value',
              nameLocation:'end',
              position:'left',
              scale : true,
              axisLine: {
                  lineStyle: {
                      color: 'white'
                  }
              },
              splitLine: {
                  lineStyle: {
                      color: 'rgba(1,102,255,0.3)'
                  }
              },
              axisLabel: {
                  textStyle: {
                      color: 'white',
                      fontWeight:600
                  },
                  formatter: '{value}'
              }
          }
      ],
      animation: true,
      series : [
          {
              name:'scatter1',
              type:'scatter',
              symbolSize:7,
              data:irr_MWKWh_data
          }
      ]
  };

    var chart = echarts.init(document.getElementById("left4_con"));
    chart.setOption(option);


}
